#include "mainwindow.h"
#include <QApplication>

int main(int argc, char *argv[])
{
    Account acc;
    Book b;
    acc.add_Account(123456,"admin",0);
    acc.add_Account(1,"zyy",1);
    //添加两个账户调试用
    Book b1;
    b1.Add_Book("1001","浮士德","Johann Wolfgang von Goethe",1,"上海文化出版社","2018","10","10",56,10,0,10);
    b1.Add_Book("1012", "时间简史", "Steven Hawking",1, "湖南科学技术出版社", "1988", "4", "1",90,10,6,4);
    b1.Add_Book("1024", "C Primer Plus", "Stephen prata", 1, "人民邮电出版社", "2001", "11", "22", 96, 20, 10, 10);
    b1.Add_Book("1015", "红楼梦", "曹雪芹", 1, "知识出版社", "2002", "5", "6", 200, 16, 8, 8);
    b1.Add_Book("1018", "悲惨世界", "维克多·雨果",1,"中国致公出版社", "2004", "6", "4", 150, 10, 8, 2);
    b1.Add_Book("1002", "巴黎圣母院", "维克多·雨果", 1, "中国致公出版社", "1998", "4", "2", 120, 25, 15, 10);
    b1.Add_Book("1005", "爱的教育", "埃迪蒙托", 1, "北京出版社", "1988", "3", "2", 50, 40, 20, 20);
    b1.Add_Book("1006", "西游记", "吴承恩", 1, "中国人民出版社", "1989", "5", "4", 80, 80, 40, 40);
    b1.Add_Book("1007", "三国演义", "罗贯中", 1, "北京出版社", "2000", "2", "4", 40, 40, 20, 20);
    b1.Add_Book("1010", "水浒传", "施耐庵", 1, "人民文学出版社", "2000", "6", "6", 50, 60, 20, 40);
    b1.Add_Book("1016", "傲慢与偏见", "简·奥斯汀", 1, "中国人民出版社", "2001", "4", "26", 32, 40, 10, 30);
    b1.Add_Book("2050", "读者", "胡亚权", 2, "甘肃人民出版社", "1981", "3", "26", 15, 100, 60, 40);
    b1.Add_Book("2055", "青年文摘", "共青团中央主管", 2, "中国青年出版社", "1981", "5", "4", 20, 200, 100, 100);
    b1.Add_Book("2060", "自然", "总编", 2, "Macmillan出版公司", "1869", "11", "4", 20, 100, 40, 60);
    b1.Add_Book("2065", "科学", "总编", 2, "美国促进会", "1894", "1", "2", 25, 100, 50, 50);
    b1.Add_Book("2070", "柳叶刀", "总编", 2, "爱斯维尔出版公司", "1823", "11", "12", 30, 70, 40, 30);
    b1.Add_Book("2101", "中国科学", "中国科学院和国家自然科学基金委员会共同主办", 2, "《中国科学》杂志社", "1950", "8", "1", 20, 20, 10, 10);
    b1.Add_Book("2102","中文核心期刊","朱强", 2, "北京大学出版社", "2011", "12", "1", 30, 15, 10, 5);
    b1.Add_Book("2103", "大众文艺", "河北省群众艺术馆", 2, "大众文艺出版社", "1956", "3", "1", 8, 30, 10, 20);
    b1.Add_Book("2104", "青年与社会", "青年与社会杂志社", 2, "青年与社会杂志社", "1953", "10", "3", 10, 30, 5, 25);
    b1.Add_Book("2105", "现代计算机", "广州中大控股有限公司主办", 2, "《现代计算机》杂志社", "1985", "6", "1", 15, 40, 20, 20);
    b1.Add_Book("3031", "人民日报", "人民日报社", 3, "人民日报社", "1948", "6", "15", 5, 40, 10, 30);
    b1.Add_Book("3032", "中国青年报", "中国青年报社", 3, "中国青年报社", "1951", "4", "27", 3, 40, 15, 25);
    b1.Add_Book("3033", "光明日报", "光明日报社", 3, "光明日报社", "1949", "6", "16", 3, 30, 10, 20);
    b1.Add_Book("3034", "中国社会报", "中国社会报社", 3, "中国社会报社", "1986", "1", "3", 1.6, 30, 10, 20);
    b1.Add_Book("3035", "中国文化报", "中国文化报社", 3, "中国文化报社", "1986", "1", "24", 3, 40, 20, 20);
    b1.Add_Book("3036", "中国艺术报", "中国艺术报社", 3, "中国艺术报社", "1995", "2", "15", 3, 40, 10, 30);
    b1.Add_Book("3037", "中国科学报", "中国科学报社", 3, "中国科学报社", "1959", "1", "1", 2, 40, 15, 25);
    b1.Add_Book("3038", "南方周末", "南方报业传媒集团", 3, "南方报业传媒集团", "1984", "5", "1", 2, 30, 10, 20);
    b1.Add_Book("3039", "大河报", "大河报编辑部", 3, "大河报编辑部", "1995", "8", "1", 1.6, 35, 15, 20);
    b1.Add_Book("3040", "齐鲁晚报", "大众报业集团", 3, "大众报业集团", "1988", "1", "1", 1, 40, 20, 20);
    //添加几本书调试用
    b.LendBook("1001");
    b.LendBook("1024");
    acc.add_book("1001",acc,2020,5,3);
    acc.add_book("1024",acc,2021,6,1);
    user.rank=-1;
    QApplication a(argc, argv);
    MainWindow w;
    w.show();

    return a.exec();
}
